In [1]:
import pandas as pd

In [ ]:
07/01/21,95,50
07/02/21,94,55
07/03/21,94,56

In [26]:
df=pd.read_clipboard(sep=',',names=['date','temperature','humidity'],parse_dates=['date'],index_col=None)

In [17]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
df

        date  temperature  humidity
0 2021-07-01           95        50
1 2021-07-02           94        55
2 2021-07-03           94        56

In [21]:
df.set_index('date',inplace=True)

In [22]:
df

            temperature  humidity
date
2021-07-01           95        50
2021-07-02           94        55
2021-07-03           94        56

In [32]:
df.set_index('date',drop=False,inplace=True)# 最后一个参数不删除设置索引的字段

In [33]:
df

                 date  temperature  humidity
date
2021-07-01 2021-07-01           95        50
2021-07-02 2021-07-02           94        55
2021-07-03 2021-07-03           94        56

### 一些操作后重置索引

In [35]:
import numpy as np
df0 = pd.DataFrame(np.random.rand(5, 3), columns=list("ABC"))
df0

          A         B         C
0  0.739108  0.340593  0.833561
1  0.662085  0.129994  0.419243
2  0.910084  0.778462  0.150557
3  0.426738  0.935360  0.112881
4  0.527963  0.738171  0.184759

In [36]:
df1 = df0[df0.index % 2 == 0]

In [37]:
df1

          A         B         C
0  0.739108  0.340593  0.833561
2  0.910084  0.778462  0.150557
4  0.527963  0.738171  0.184759

In [41]:
df1.reset_index(drop=True,inplace=True)

In [42]:
df1

          A         B         C
0  0.739108  0.340593  0.833561
1  0.910084  0.778462  0.150557
2  0.527963  0.738171  0.184759

In [43]:
df0

          A         B         C
0  0.739108  0.340593  0.833561
1  0.662085  0.129994  0.419243
2  0.910084  0.778462  0.150557
3  0.426738  0.935360  0.112881
4  0.527963  0.738171  0.184759

### 将索引从 groupby 操作转换为列

In [44]:
df0["team"] = ["X", "X", "Y", "Y", "Y"]

In [45]:
df0

          A         B         C team
0  0.739108  0.340593  0.833561    X
1  0.662085  0.129994  0.419243    X
2  0.910084  0.778462  0.150557    Y
3  0.426738  0.935360  0.112881    Y
4  0.527963  0.738171  0.184759    Y

In [46]:
df0.groupby("team").mean()

             A         B         C
team
X     0.700596  0.235294  0.626402
Y     0.621595  0.817331  0.149399

In [47]:
df0.groupby('team',as_index=False).mean()

  team         A         B         C
0    X  0.700596  0.235294  0.626402
1    Y  0.621595  0.817331  0.149399

In [48]:
df0

          A         B         C team
0  0.739108  0.340593  0.833561    X
1  0.662085  0.129994  0.419243    X
2  0.910084  0.778462  0.150557    Y
3  0.426738  0.935360  0.112881    Y
4  0.527963  0.738171  0.184759    Y

In [50]:
df0.drop_duplicates("team")

          A         B         C team
0  0.739108  0.340593  0.833561    X
2  0.910084  0.778462  0.150557    Y

In [49]:
df0.drop_duplicates("team", ignore_index=True)

          A         B         C team
0  0.739108  0.340593  0.833561    X
1  0.910084  0.778462  0.150557    Y

In [51]:
import datetime

In [53]:
date_now=datetime.datetime.now().date()

In [57]:
date_now.strftime('%Y-%m-%d')

'2022-02-03'